Klangstrom/klangstrom-libraries/KLST_PANDA/variant/boards.txt
################################################################################
# Klangstrom KLST_PANDA ( STM32H723ZGT )
KLST_PANDA.name=Klangstrom KLST_PANDA (STM32H723ZGT)

KLST_PANDA.build.core=arduino
KLST_PANDA.build.board=Klangstrom KLST_PANDA
KLST_PANDA.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} -DKLST_ENV=0x36
KLST_PANDA.build.fpu=-mfpu=fpv4-sp-d16
KLST_PANDA.build.float-abi=-mfloat-abi=hard
KLST_PANDA.build.series=STM32H7xx
KLST_PANDA.build.mcu=cortex-m7
KLST_PANDA.build.flash_offset=0x0
KLST_PANDA.upload.maximum_size=0
KLST_PANDA.upload.maximum_data_size=0

# Klangstrom KLST_PANDA board
KLST_PANDA.menu.pnum.KLST_PANDA=Klangstrom KLST_PANDA
KLST_PANDA.menu.pnum.KLST_PANDA.node=KLST_PANDA
KLST_PANDA.menu.pnum.KLST_PANDA.upload.maximum_size=1048576
KLST_PANDA.menu.pnum.KLST_PANDA.upload.maximum_data_size=577536
KLST_PANDA.menu.pnum.KLST_PANDA.build.board=KLST_PANDA
KLST_PANDA.menu.pnum.KLST_PANDA.build.product_line=STM32H723xx
KLST_PANDA.menu.pnum.KLST_PANDA.build.variant_h=variant_{build.board}.h
KLST_PANDA.menu.pnum.KLST_PANDA.build.variant=STM32H7xx/H723Z(E-G)T_H730ZBT_H733ZGT
KLST_PANDA.menu.pnum.KLST_PANDA.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
KLST_PANDA.menu.pnum.KLST_PANDA.build.ldscript=STM32H723ZGTX_FLASH.ld
KLST_PANDA.menu.pnum.KLST_PANDA.build.vid=0 # set proper value
KLST_PANDA.menu.pnum.KLST_PANDA.build.pid=0 # set proper value

# Upload menu
KLST_PANDA.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
KLST_PANDA.menu.upload_method.swdMethod.upload.protocol=0
KLST_PANDA.menu.upload_method.swdMethod.upload.options=
KLST_PANDA.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

KLST_PANDA.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
KLST_PANDA.menu.upload_method.serialMethod.upload.protocol=1
KLST_PANDA.menu.upload_method.serialMethod.upload.options={serial.port.file}
KLST_PANDA.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

KLST_PANDA.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
KLST_PANDA.menu.upload_method.dfuMethod.upload.protocol=2
KLST_PANDA.menu.upload_method.dfuMethod.upload.options=
KLST_PANDA.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

KLST_PANDA.menu.xserial.generic=Enabled (generic 'Serial')
KLST_PANDA.menu.xserial.none=Enabled (no generic 'Serial')
KLST_PANDA.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
KLST_PANDA.menu.xserial.disabled=Disabled (No Serial support)
KLST_PANDA.menu.xserial.disabled.build.xSerial=

KLST_PANDA.menu.usb.none=None
KLST_PANDA.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
KLST_PANDA.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
KLST_PANDA.menu.usb.CDC=CDC (no generic 'Serial')
KLST_PANDA.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
KLST_PANDA.menu.usb.HID=HID (keyboard and mouse)
KLST_PANDA.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
KLST_PANDA.menu.xusb.FS=Low/Full Speed
KLST_PANDA.menu.xusb.HS=High Speed
KLST_PANDA.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
KLST_PANDA.menu.xusb.HSFS=High Speed in Full Speed mode
KLST_PANDA.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

KLST_PANDA.menu.opt.osstd=Smallest (-Os default)
KLST_PANDA.menu.opt.oslto=Smallest (-Os) with LTO
KLST_PANDA.menu.opt.oslto.build.flags.optimize=-Os -flto
KLST_PANDA.menu.opt.o1std=Fast (-O1)
KLST_PANDA.menu.opt.o1std.build.flags.optimize=-O1
KLST_PANDA.menu.opt.o1lto=Fast (-O1) with LTO
KLST_PANDA.menu.opt.o1lto.build.flags.optimize=-O1 -flto
KLST_PANDA.menu.opt.o2std=Faster (-O2)
KLST_PANDA.menu.opt.o2std.build.flags.optimize=-O2
KLST_PANDA.menu.opt.o2lto=Faster (-O2) with LTO
KLST_PANDA.menu.opt.o2lto.build.flags.optimize=-O2 -flto
KLST_PANDA.menu.opt.o3std=Fastest (-O3)
KLST_PANDA.menu.opt.o3std.build.flags.optimize=-O3
KLST_PANDA.menu.opt.o3lto=Fastest (-O3) with LTO
KLST_PANDA.menu.opt.o3lto.build.flags.optimize=-O3 -flto
KLST_PANDA.menu.opt.ogstd=Debug (-Og)
KLST_PANDA.menu.opt.ogstd.build.flags.optimize=-Og
KLST_PANDA.menu.opt.o0std=No Optimization (-O0)
KLST_PANDA.menu.opt.o0std.build.flags.optimize=-O0

KLST_PANDA.menu.dbg.none=None
KLST_PANDA.menu.dbg.enable_sym=Symbols Enabled (-g)
KLST_PANDA.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
KLST_PANDA.menu.dbg.enable_log=Core logs Enabled
KLST_PANDA.menu.dbg.enable_log.build.flags.debug=
KLST_PANDA.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
KLST_PANDA.menu.dbg.enable_all.build.flags.debug=-g

KLST_PANDA.menu.rtlib.nano=Newlib Nano (default)
KLST_PANDA.menu.rtlib.nanofp=Newlib Nano + Float Printf
KLST_PANDA.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
KLST_PANDA.menu.rtlib.nanofs=Newlib Nano + Float Scanf
KLST_PANDA.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
KLST_PANDA.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
KLST_PANDA.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
KLST_PANDA.menu.rtlib.full=Newlib Standard
KLST_PANDA.menu.rtlib.full.build.flags.ldspecs=

################################################################################
# Klangstrom KLST_CATERPILLAR ( STM32H723ZGT )
KLST_CATERPILLAR.name=Klangstrom KLST_CATERPILLAR (STM32H723ZGT)

KLST_CATERPILLAR.build.core=arduino
KLST_CATERPILLAR.build.board=Klangstrom
KLST_CATERPILLAR.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} -DKLST_ENV=0x37
KLST_CATERPILLAR.build.fpu=-mfpu=fpv4-sp-d16
KLST_CATERPILLAR.build.float-abi=-mfloat-abi=hard
KLST_CATERPILLAR.build.series=STM32H7xx
KLST_CATERPILLAR.build.mcu=cortex-m7
KLST_CATERPILLAR.build.flash_offset=0x0
KLST_CATERPILLAR.upload.maximum_size=0
KLST_CATERPILLAR.upload.maximum_data_size=0

# Klangstrom KLST_CATERPILLAR board
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR=Klangstrom KLST_CATERPILLAR
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.node=KLST_CATERPILLAR
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.upload.maximum_size=1048576
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.upload.maximum_data_size=577536
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.build.board=KLST_CATERPILLAR
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.build.product_line=STM32H723xx
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.build.variant_h=variant_{build.board}.h
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.build.variant=STM32H7xx/H723Z(E-G)T_H730ZBT_H733ZGT
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.build.ldscript=variant_KLST_CATERPILLAR.ld
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.build.vid=0 # set proper value
KLST_CATERPILLAR.menu.pnum.KLST_CATERPILLAR.build.pid=0 # set proper value

# Upload menu
KLST_CATERPILLAR.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
KLST_CATERPILLAR.menu.upload_method.swdMethod.upload.protocol=0
KLST_CATERPILLAR.menu.upload_method.swdMethod.upload.options=
KLST_CATERPILLAR.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

KLST_CATERPILLAR.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
KLST_CATERPILLAR.menu.upload_method.serialMethod.upload.protocol=1
KLST_CATERPILLAR.menu.upload_method.serialMethod.upload.options={serial.port.file}
KLST_CATERPILLAR.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

KLST_CATERPILLAR.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
KLST_CATERPILLAR.menu.upload_method.dfuMethod.upload.protocol=2
KLST_CATERPILLAR.menu.upload_method.dfuMethod.upload.options=
KLST_CATERPILLAR.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

KLST_CATERPILLAR.menu.xserial.generic=Enabled (generic 'Serial')
KLST_CATERPILLAR.menu.xserial.none=Enabled (no generic 'Serial')
KLST_CATERPILLAR.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
KLST_CATERPILLAR.menu.xserial.disabled=Disabled (No Serial support)
KLST_CATERPILLAR.menu.xserial.disabled.build.xSerial=

KLST_CATERPILLAR.menu.usb.none=None
KLST_CATERPILLAR.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
KLST_CATERPILLAR.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
KLST_CATERPILLAR.menu.usb.CDC=CDC (no generic 'Serial')
KLST_CATERPILLAR.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
KLST_CATERPILLAR.menu.usb.HID=HID (keyboard and mouse)
KLST_CATERPILLAR.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
KLST_CATERPILLAR.menu.xusb.FS=Low/Full Speed
KLST_CATERPILLAR.menu.xusb.HS=High Speed
KLST_CATERPILLAR.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
KLST_CATERPILLAR.menu.xusb.HSFS=High Speed in Full Speed mode
KLST_CATERPILLAR.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

KLST_CATERPILLAR.menu.opt.osstd=Smallest (-Os default)
KLST_CATERPILLAR.menu.opt.oslto=Smallest (-Os) with LTO
KLST_CATERPILLAR.menu.opt.oslto.build.flags.optimize=-Os -flto
KLST_CATERPILLAR.menu.opt.o1std=Fast (-O1)
KLST_CATERPILLAR.menu.opt.o1std.build.flags.optimize=-O1
KLST_CATERPILLAR.menu.opt.o1lto=Fast (-O1) with LTO
KLST_CATERPILLAR.menu.opt.o1lto.build.flags.optimize=-O1 -flto
KLST_CATERPILLAR.menu.opt.o2std=Faster (-O2)
KLST_CATERPILLAR.menu.opt.o2std.build.flags.optimize=-O2
KLST_CATERPILLAR.menu.opt.o2lto=Faster (-O2) with LTO
KLST_CATERPILLAR.menu.opt.o2lto.build.flags.optimize=-O2 -flto
KLST_CATERPILLAR.menu.opt.o3std=Fastest (-O3)
KLST_CATERPILLAR.menu.opt.o3std.build.flags.optimize=-O3
KLST_CATERPILLAR.menu.opt.o3lto=Fastest (-O3) with LTO
KLST_CATERPILLAR.menu.opt.o3lto.build.flags.optimize=-O3 -flto
KLST_CATERPILLAR.menu.opt.ogstd=Debug (-Og)
KLST_CATERPILLAR.menu.opt.ogstd.build.flags.optimize=-Og
KLST_CATERPILLAR.menu.opt.o0std=No Optimization (-O0)
KLST_CATERPILLAR.menu.opt.o0std.build.flags.optimize=-O0

KLST_CATERPILLAR.menu.dbg.none=None
KLST_CATERPILLAR.menu.dbg.enable_sym=Symbols Enabled (-g)
KLST_CATERPILLAR.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
KLST_CATERPILLAR.menu.dbg.enable_log=Core logs Enabled
KLST_CATERPILLAR.menu.dbg.enable_log.build.flags.debug=
KLST_CATERPILLAR.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
KLST_CATERPILLAR.menu.dbg.enable_all.build.flags.debug=-g

KLST_CATERPILLAR.menu.rtlib.nano=Newlib Nano (default)
KLST_CATERPILLAR.menu.rtlib.nanofp=Newlib Nano + Float Printf
KLST_CATERPILLAR.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
KLST_CATERPILLAR.menu.rtlib.nanofs=Newlib Nano + Float Scanf
KLST_CATERPILLAR.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
KLST_CATERPILLAR.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
KLST_CATERPILLAR.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
KLST_CATERPILLAR.menu.rtlib.full=Newlib Standard
KLST_CATERPILLAR.menu.rtlib.full.build.flags.ldspecs=
